<template>
  <div class="compare">
      <div class="container">
          <div class="compare__container">
              <div class="section-title compare__title">
                  <div class="section-title-text">Давайте сравним с металлическими трубами?</div>
              </div>
              <div class="compare__list">
                  <div class="compare__item">
                      <div class="compare__num">
                          <svg width="144" height="300" viewBox="0 0 144 300" fill="none" xmlns="http://www.w3.org/2000/svg">
                              <path d="M0 62.3377C8.36036 58.8745 17.009 54.9783 25.9459 50.6493C35.1712 46.0317 44.1081 41.1255 52.7568 35.9307C61.4054 30.4473 69.6216 24.8196 77.4054 19.0476C85.4775 12.987 92.6847 6.63781 99.027 0H144V300H79.5676V83.9827C70.9189 89.7547 61.2613 95.0938 50.5946 100C39.9279 104.618 29.5496 108.658 19.4595 112.121L0 62.3377Z" fill="url(#paint0_linear_748_15977)"/>
                              <defs>
                                  <linearGradient id="paint0_linear_748_15977" x1="97.2973" y1="119.263" x2="97.2973" y2="292.423" gradientUnits="userSpaceOnUse">
                                      <stop stop-color="#2598D2"/>
                                      <stop offset="1" stop-color="#224386"/>
                                  </linearGradient>
                              </defs>
                          </svg>
                      </div>
                      <div class="compare__hero">
                          <div class="compare__item-title">надежность</div>
                          <div class="compare__text">
                              Комплекты труб из полипропилена системы Alpha защищены от коррозии, сохраняют проходимость и производительность, а также не требуют ухода в процессе эксплуатации, в отличие от металлических труб. <br>
                              Стоимость ППР-труб и фитингов позволяет и услуги по монтажу выгодно отличается от аналогов из металла. Сотрудничество с нами даст сантехникам-монтажникам преимущество на рынке и поможет повысить продажи услуг.
                          </div>
                      </div>
                  </div>
                  <div class="compare__item">
                      <div class="compare__num">
                          <svg width="210" height="307" viewBox="0 0 210 307" fill="none" xmlns="http://www.w3.org/2000/svg">
                              <path d="M200.851 85.7348C200.851 96.7043 198.672 107.241 194.315 117.344C189.959 127.448 184.295 137.262 177.324 146.788C170.353 156.026 162.51 164.975 153.797 173.635C145.083 182.295 136.515 190.522 128.091 198.316C123.734 202.357 118.942 206.976 113.714 212.172C108.776 217.079 103.983 222.131 99.3361 227.327C94.6888 232.523 90.4772 237.431 86.7012 242.049C83.2158 246.379 81.0373 249.988 80.166 252.874H210V307H8.71369C8.13278 303.825 7.84232 299.783 7.84232 294.876C7.84232 289.969 7.84232 286.504 7.84232 284.484C7.84232 270.628 10.0207 257.926 14.3776 246.379C19.0249 234.833 24.9793 224.152 32.2407 214.337C39.5021 204.234 47.6349 194.852 56.639 186.192C65.9336 177.532 75.083 168.872 84.0871 160.212C91.0581 153.572 97.5934 147.366 103.693 141.592C109.793 135.53 115.166 129.757 119.813 124.272C124.461 118.499 128.091 112.87 130.705 107.385C133.319 101.612 134.627 95.8383 134.627 90.0649C134.627 77.3634 130.996 68.4147 123.734 63.2186C116.473 58.0226 107.469 55.4246 96.722 55.4246C88.8797 55.4246 81.473 56.7236 74.5021 59.3216C67.8216 61.631 61.5768 64.5176 55.7676 67.9817C50.249 71.157 45.4564 74.4767 41.39 77.9408C37.3237 81.1161 34.2739 83.7142 32.2407 85.7348L0 40.7024C12.7801 28.867 27.5934 19.1965 44.4398 11.6911C61.5768 3.89704 79.8755 0 99.3361 0C117.054 0 132.303 2.02069 145.083 6.06206C157.863 10.1034 168.32 15.8768 176.452 23.3822C184.876 30.599 190.975 39.5477 194.751 50.2285C198.817 60.6206 200.851 72.456 200.851 85.7348Z" fill="url(#paint0_linear_748_15978)"/>
                                  <defs>
                                  <linearGradient id="paint0_linear_748_15978" x1="113.278" y1="126.222" x2="113.278" y2="299.424" gradientUnits="userSpaceOnUse">
                                      <stop stop-color="#2598D2"/>
                                      <stop offset="1" stop-color="#224386"/>
                                  </linearGradient>
                              </defs>
                          </svg>
                      </div>
                      <div class="compare__hero">
                          <div class="compare__item-title">Универсальность</div>
                          <div class="compare__text">
                              Комплекты Alpha предназначены для прокладки систем подачи холодной и горячей воды, отопления на базе газовых и электрических котлов, систем «теплый пол». В наборы включена регулирующая и запорная арматура в корпусах из прочного материала. <br>
                              Металлические трубы подойдут не для каждой цели. <br>
                              С помощью наших систем можно проложить инженерную сеть квартиры, дома, магазина, торгового центра. Alpha поможет расширить спектр предоставляемых услуг и увеличить прибыльность работы компании.
                          </div>
                      </div>
                  </div>
                  <div class="compare__item">
                      <div class="compare__num">
                          <svg width="206" height="314" viewBox="0 0 206 314" fill="none" xmlns="http://www.w3.org/2000/svg">
                              <path d="M86.8727 314C79.1315 314 70.9603 313.422 62.3591 312.265C53.7578 311.398 45.4433 310.097 37.4155 308.362C29.3876 306.627 22.0765 304.748 15.4823 302.724C8.88796 300.7 3.72721 298.82 0 297.086L12.4718 243.307C19.9262 246.487 29.3876 249.957 40.856 253.715C52.611 257.185 67.0898 258.92 84.2923 258.92C104.075 258.92 118.554 255.161 127.729 247.644C136.903 240.126 141.491 230.006 141.491 217.285C141.491 209.478 139.77 202.972 136.33 197.768C133.176 192.274 128.732 187.937 122.998 184.757C117.264 181.287 110.383 178.974 102.355 177.818C94.6138 176.372 86.2992 175.649 77.4113 175.649H52.4676V123.605H80.8518C87.1594 123.605 93.1802 123.027 98.9144 121.87C104.935 120.714 110.239 118.834 114.827 116.232C119.414 113.341 122.998 109.582 125.578 104.956C128.445 100.041 129.879 93.9687 129.879 86.7403C129.879 81.2468 128.732 76.4761 126.438 72.4282C124.145 68.3803 121.134 65.0553 117.407 62.4531C113.967 59.8509 109.809 57.9715 104.935 56.8149C100.348 55.3693 95.6173 54.6464 90.7432 54.6464C78.4148 54.6464 66.9464 56.5258 56.3382 60.2845C46.0167 64.0433 36.5553 68.6694 27.9541 74.163L5.16075 26.8895C9.74809 23.9982 15.0522 20.9623 21.0731 17.7818C27.3807 14.6013 34.2617 11.71 41.7161 9.10775C49.1705 6.50554 57.055 4.33703 65.3695 2.60223C73.9708 0.867409 83.0021 0 92.4635 0C109.953 0 125.005 2.16851 137.62 6.50554C150.522 10.5534 161.13 16.4807 169.445 24.2873C177.759 31.8048 183.923 40.768 187.937 51.1768C191.951 61.2965 193.958 72.4282 193.958 84.5718C193.958 96.4264 190.661 107.992 184.067 119.268C177.473 130.255 168.585 138.64 157.403 144.423C172.885 150.784 184.784 160.325 193.098 173.047C201.699 185.48 206 200.515 206 218.152C206 232.03 203.706 244.897 199.119 256.751C194.532 268.317 187.364 278.436 177.616 287.111C167.868 295.495 155.396 302.146 140.2 307.061C125.292 311.687 107.516 314 86.8727 314Z" fill="url(#paint0_linear_748_15979)"/>
                              <defs>
                                  <linearGradient id="paint0_linear_748_15979" x1="115.686" y1="126.426" x2="115.686" y2="299.906" gradientUnits="userSpaceOnUse">
                                      <stop stop-color="#2598D2"/>
                                      <stop offset="1" stop-color="#224386"/>
                                  </linearGradient>
                              </defs>
                          </svg>
                      </div>
                      <div class="compare__hero">
                          <div class="compare__item-title">Безопасность</div>
                          <div class="compare__text">
                              Наборы Alpha сделаны из безопасных и экологичных материалов. Они не вредят здоровью человека и не изменяют состав водопроводной воды. Все товары сертифицированы и соответствуют требованиям действующих ГОСТ, СанПиН, СНиП. <br>
                              Металлические трубы со временем подвергаются коррозии, и их экологичность существенно понижается. <br>
                              Наши трубы и фитинги можно монтировать в помещениях с повышенными требованиями к санитарному состоянию. Они не протекут и не лопнут в течение всего срока службы.
                          </div>
                      </div>
                  </div>
              </div>
          </div>
      </div>
  </div>
</template>

<script>
export default {

}
</script>

<style scoped lang="sass">
.compare
    position: relative
    &::before
        content: ''
        position: absolute
        left: 0
        top: 140px
        width: min(30vw, 600px)
        height: min(58vw, 1110px)
        background: url('@/assets/alpha-compare/pipes.png') no-repeat
        background-size: cover
        z-index: 1
        pointer-events: none
    &__container
        padding-top: 118px
        padding-bottom: 300px
        background: url('@/assets/alpha-compare/bg.png') no-repeat
        background-size: 100% auto
        background-position-x: center
        background-position-y: center
    &__title
        margin-bottom: 136px
    &__item
        display: flex
        align-items: flex-end
        margin-bottom: 55px
        &:nth-child(1)
            padding-left: 471px
        &:nth-child(2)
            padding-left: 259px
            & .compare__hero
                margin-top: 19px
        &:nth-child(3)
            padding-left: 60px
    &__num
        margin-right: 44px
    &__item-title
        font-weight: 700
        font-size: 32px
        line-height: 130%
        text-transform: uppercase
        color: var(--primary-color)
        margin-bottom: 32px
    &__text
        font-size: 22px
        color: #6C7689
        line-height: 160%
        text-align: justify

@media screen and (max-width: 1600px)
    .compare
        &::before
            content: ''
            position: absolute
            left: 0
            top: 140px
            width: min(30vw, 370px)
            height: min(58vw, 690px)
        &__container
            padding-top: 100px
            padding-bottom: 240px
        &__title
            margin-bottom: 90px
        &__item
            margin-bottom: 30px
            &:nth-child(1)
                padding-left: 240px
                & .compare__num svg
                    width: 90px
            &:nth-child(2)
                padding-left: 120px
            &:nth-child(3)
                padding-left: 0px
        &__num
            margin-right: 28px
            & svg
                width: 130px
                height: 190px
        &__item-title
            margin-bottom: 20px
        &__text
            font-size: 14px
</style>