<template>
  <main>
    <div class="container">
        <div class="breadcrumbs">
            <BreadCrumbs />
        </div>
    </div>
    <div class="terms-baner">
        <div class="container">
            <div class="terms-baner__hero">
                <h1 class="terms-baner__title">Пользовательское соглашение</h1>
                <div class="terms-baner__text">
                    Уважаемый покупатель, мы рады приветствовать вас в нашем интернет-магазине. На этой странице вы можете изучить пользовательское соглашение. В нем указаны основные правила пользования нашими услугами.
                </div>
            </div>
        </div>
    </div>
    <div class="container term-container">
        <h2 class="term-title">Политика в отношении обработки персональных данных</h2>
        <div class="term-ol">1. Общие положения</div>
        <div class="terms-text">Настоящая политика обработки персональных данных составлена в соответствии с требованиями Федерального закона от 27.07.2006. №152-ФЗ «О персональных данных» и определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных Обществом с ограниченной ответственностью «РТП» (далее – Оператор).</div>
        <div class="term-sublist">
            <div class="term-sublist-item" data-num="1">Оператор ставит своей важнейшей целью и условием осуществления своей деятельности 	соблюдение прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.</div>
            <div class="term-sublist-item" data-num="2">Настоящая политика Оператора в отношении обработки персональных данных (далее – Политика) 	применяется ко всей информации, которую Оператор может получить о посетителях веб-сайта <a href="rtp.ru" target="_blank">rtp.ru</a>.</div>
        </div>
        <div class="term-ol">2. Основные понятия, используемые в Политике</div>
        <div class="term-sublist">
            <div class="term-sublist-item" data-num="1">Автоматизированная обработка персональных данных – обработка персональных данных с помощью 	средств вычислительной техники;</div>
            <div class="term-sublist-item" data-num="2">Блокирование персональных данных – временное прекращение обработки персональных данных (за исключением случаев, если обработка необходима для уточнения 	персональных данных);</div>
            <div class="term-sublist-item" data-num="3">Веб-сайт – совокупность графических и информационных материалов, а также программ для ЭВМ и баз данных, обеспечивающих их доступность в сети интернет по сетевому адресу <a href="rtp.ru" target="_blank">rtp.ru</a>;</div>
            <div class="term-sublist-item" data-num="4">Информационная система персональных данных — 	совокупность содержащихся в базах данных персональных данных, и обеспечивающих их обработку информационных технологий и технических средств;</div>
            <div class="term-sublist-item" data-num="5">Обезличивание персональных данных — действия, в 	результате которых невозможно определить без использования дополнительной информации принадлежность персональных данных конкретному Пользователю или иному субъекту персональных данных;</div>
            <div class="term-sublist-item" data-num="6">Обработка персональных данных – любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных;</div>
            <div class="term-sublist-item" data-num="7">Оператор – государственный орган, муниципальный	орган, юридическое или физическое лицо, самостоятельно или совместно с другими 	лицами организующие и (или) осуществляющие 	обработку персональных данных, а также 	определяющие цели обработки персональных данных,состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными;</div>
            <div class="term-sublist-item" data-num="8">Персональные данные – любая информация, относящаяся прямо или косвенно к определенному или определяемому Пользователю веб-сайта <a href="rtp.ru" target="_blank">rtp.ru</a>;</div>
            <div class="term-sublist-item" data-num="9">Пользователь – любой посетитель веб-сайта <a href="rtp.ru" target="_blank">rtp.ru</a>;</div>
            <div class="term-sublist-item" data-num="10">Предоставление персональных данных – действия, направленные на раскрытие персональных данных определенному лицу или определенному кругу лиц;</div>
            <div class="term-sublist-item" data-num="11">Распространение персональных данных – любые действия, направленные на раскрытие персональных данных неопределенному кругу лиц (передача персональных данных) или на ознакомление с персональными данными неограниченного круга лиц, в том числе обнародование персональных данных в средствах массовой информации, размещение в информационно-телекоммуникационных сетях или предоставление доступа к персональным данным каким-либо иным способом;</div>
            <div class="term-sublist-item" data-num="12">Трансграничная передача персональных данных – передача персональных данных на территорию иностранного государства органу власти иностранного государства, иностранному физическому или иностранному юридическому лицу;</div>
            <div class="term-sublist-item" data-num="13">Уничтожение 	персональных данных – любые действия, в результате которых персональные данные уничтожаются безвозвратно с невозможностью дальнейшего восстановления содержания персональных данных в информационной системе персональных данных и (или) результате которых уничтожаются материальные носители персональных данных.</div>
        </div>
        <div class="term-ol">3. Оператор может обрабатывать следующие персональные данные Пользователя</div>
        <div class="term-sublist">
            <div class="term-sublist-item" data-num="1">Фамилия, Имя или Отчество</div>
            <div class="term-sublist-item" data-num="2">Электронная почта</div>
            <div class="term-sublist-item" data-num="3">Номер телефона</div>
        </div>
        <div class="term-ol">4. Оператор использует следующие формы обработки данных Пользователя</div>
        <div class="term-sublist">
            <div class="term-sublist-item" data-num="1">Форма заказа с вводом личных данных</div>
            <div class="term-sublist-item" data-num="2">Форма обратной связи</div>
            <div class="term-sublist-item" data-num="3">Счетчик аналитики (например, яндекс-метрика)</div>
            <div class="term-sublist-item" data-num="4">Виджет заказа обратного звонка</div>
        </div>
        <div class="term-ol">5. Оператор предоставляет следующие виды услуг</div>
        <div class="term-sublist">
            <div class="term-sublist-item" data-num="1">Доступ к средствам поиска и навигации сайта</div>
            <div class="term-sublist-item" data-num="2">Доступ к информации о Товаре и/или услуге к информации о приобретении Товара на платной/бесплатной основе</div>
        </div>
        <div class="term-ol">6. Правовые основания обработки персональных данных</div>
        <div class="term-sublist">
            <div class="term-sublist-item" data-num="1">Оператор обрабатывает персональные данные Пользователя только в случае их заполнения и/или отправки Пользователем самостоятельно через специальные формы, расположенные на сайте rtp.ru. 	Заполняя соответствующие формы и/или 	отправляя свои персональные данные Оператору,Пользователь выражает свое согласие с данной Политикой.</div>
            <div class="term-sublist-item" data-num="2">Оператор обрабатывает обезличенные данные о Пользователе в случае, если это разрешено в настройках браузера Пользователя (включено сохранение файлов «cookie» и использование технологии JavaScript).</div>
            <div class="term-sublist-item" data-num="3">Оператор осуществляет хранение персональных данных в форме, позволяющей определить субъекта персональных данных, не дольше, чем этого требуют цели обработки персональных данных.</div>
        </div>
        <div class="term-ol">8. Цели для которых может использоваться информация, предоставленная на сайте</div>
        <div class="term-sublist">
            <div class="term-sublist-item" data-num="1">Для личных некоммерческих целей</div>
            <div class="term-sublist-item" data-num="2">В коммерческих целях без специального разрешения</div>
        </div>
        <div class="term-ol">9. Цель обработки данных</div>
        <div class="term-sublist">
            <div class="term-sublist-item" data-num="1">Идентификация стороны в рамках соглашений и договоров с сайтом</div>
            <div class="term-sublist-item" data-num="2">Связь с пользователем, в том числе направление уведомлений, запросов и информации касающихся использования сайта, оказания услуг, обработка запросов и заявок от пользователя</div>
            <div class="term-sublist-item" data-num="3">Улучшение качества сайта, удобства его использования, разработка новых товаров и услуг </div>
            <div class="term-sublist-item" data-num="4">Передача данных третьим лицам, в целях осуществления	деятельности ресурса (например: доставка товара курьером, транспортной компанией и иные).</div>
        </div>
        <div class="term-ol">10. Порядок сбора, хранения, передачи и других видов обработки персональных данных</div>
        <div class="terms-text">Безопасность персональных данных, которые обрабатываются Оператором, обеспечивается путем реализации правовых, организационных и технических мер, необходимых для выполнения в полном объеме требований действующего законодательства в области защиты персональных данных.</div>
        <div class="term-sublist">
            <div class="term-sublist-item" data-num="1">Оператор обеспечивает сохранность персональных данных и принимает все возможные меры, исключающие доступ к персональным данным неуполномоченных лиц.</div>
            <div class="term-sublist-item" data-num="2">Персональные данные Пользователя никогда, ни при каких условиях не будут переданы третьим лицам, за исключением случаев, связанных с исполнением действующего законодательства.</div>
            <div class="term-sublist-item" data-num="3">В случае выявления неточностей в персональных данных, Пользователь может актуализировать их самостоятельно, путем направления Оператору уведомление на адрес электронной почты Оператора <a href="mailto:sales@rtp.ru">sales@rtp.ru</a> с пометкой «Актуализация персональных данных». </div>
            <div class="term-sublist-item" data-num="4">Срок обработки персональных данных является неограниченным. Пользователь может в любой момент отозвать свое согласие на обработку персональных данных, направив Оператору уведомление посредством электронной почты на электронный адрес Оператора <a href="mailto:sales@rtp.ru">sales@rtp.ru</a> с пометкой «Отзыв согласия на обработку персональных данных». </div>
        </div>
        <div class="term-ol">11. Заключительные положения</div>
        <div class="term-sublist">
            <div class="term-sublist-item" data-num="1">Пользователь может получить любые разъяснения по интересующим вопросам, касающимся обработки его персональных данных, обратившись к Оператору с помощью электронной почты <a href="mailto:sales@rtp.ru">sales@rtp.ru</a>.</div>
            <div class="term-sublist-item" data-num="2">В данном документе будут отражены любые изменения политики обработки персональных данных Оператором. Политика действует бессрочно до замены ее новой версией.</div>
        </div>
    </div>
  </main>
</template>

<script>
import BreadCrumbs from '../components/BreadCrumbs/BreadCrumbs.vue'

export default {
    components: {
        BreadCrumbs,
    },
    mounted(){
        window.scrollTo(0, 0);
    },
}
</script>

<style scoped lang="sass">
.breadcrumbs
    margin-top: 5px
.terms-baner
    width: 100%
    background: url('@/assets/terms-of-use/baner.jpg') no-repeat
    background-size: cover
    background-position-x: center
    margin-top: 42px
    margin-bottom: 55px
    &__hero
        padding: 63px 0 86px
        color: #fff
    &__title
        font-weight: 700
        font-size: 40px
        line-height: 121%
        margin-bottom: 32px
    &__text
        font-weight: 500
        font-size: 16px
        line-height: 1.5
        max-width: 650px
.term-title
    color: #828D99
    margin-bottom: 24px
.term-ol
    color: #828D99
    margin-bottom: 12px
    line-height: 1.56
    font-size: 18px
    font-weight: 500
.term-sublist
    padding-left: 36px
.term-sublist-item
    position: relative
    font-size: 16px
    color: #828D99
    line-height: 1.56
    margin-bottom: 6px
    &::before
        content: attr(data-num)
        position: absolute
        left: -25px
        top: 0
    & a
        color: #828D99
.terms-text
    font-size: 16px
    line-height: 1.56
    color: #828D99
    margin-bottom: 12px
.term-container
    margin-bottom: 87px

@media screen and (max-width: 1200px)
    .terms-baner
        margin-top: 32px
        margin-bottom: 20px
        &__hero
            padding: 30px 0
        &__title
            font-size: 20px
            margin-bottom: 14px
        &__text
            font-size: 9px
            max-width: 375px
    .term-title
        margin-bottom: 14px
        font-size: 20px
    .term-ol
        margin-bottom: 6px
        font-size: 12px
    .term-sublist
        padding-left: 24px
    .term-sublist-item
        font-size: 9px
        margin-bottom: 6px
        &::before
            left: -25px
    .terms-text
        font-size: 9px
        margin-bottom: 8px
    .term-container
        margin-bottom: 34px
</style>